Documents/ESB/ESB_Consumer_1006/003TestSample/SAMPLE_XML_MUST/CardAuthorization/CD03_ICCTACVrfyRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/CardAuthorization/ICCTACVrfyRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>CardAuthorization</ServiceDomain>  
      <OperationName>ICCTACVrfy</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:ICCTACVrfyRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>CD03</v11:TxnId>  
        <v11:TxnNo>CD0300001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CustPermId>A123456789</v11:CustPermId>  
        <v11:ChanId>CCS</v11:ChanId>  
        <v11:DbAcctNo>1234567890123450</v11:DbAcctNo>  
        <v11:TermChkCode>90099772</v11:TermChkCode>  
        <v11:ICCMemo>轉帳</v11:ICCMemo>  
        <v11:ICCSeqNo>29097737</v11:ICCSeqNo>  
        <v11:ICCTAC>4321123443211230</v11:ICCTAC> 
      </v11:ServiceBody> 
    </v11:ICCTACVrfyRq> 
  </soap:Body> 
</soap:Envelope>
